explicitRhoFoam/PrandtlMeyerExpansion/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1912                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       9850;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       9900;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       9950;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       10050;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       10150;
    }
)

// ************************************************************************* //
